#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.cw_loggroup: Refreshing state... [id=example]
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0870bffca2421a1e1]
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=20969733]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347]
aws_iam_role.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role]
aws_iam_role_policy.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role:vpc_flowlog_role]
aws_flow_log.app1: Refreshing state... [id=fl-0cb74829c70170799]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cw_loggroup must be replaced
-/+ resource "aws_cloudwatch_log_group" "cw_loggroup" {
      ~ arn               = "arn:aws:logs:us-east-2:796344116454:log-group:example" -> (known after apply)
      ~ id                = "example" -> (known after apply)
      ~ name              = "example" -> "vpc-flowlog" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_flow_log.app1 must be replaced
-/+ resource "aws_flow_log" "app1" {
      ~ arn                      = "arn:aws:ec2:us-east-2:796344116454:vpc-flow-log/fl-0cb74829c70170799" -> (known after apply)
      ~ id                       = "fl-0cb74829c70170799" -> (known after apply)
      ~ log_destination          = "arn:aws:logs:us-east-2:796344116454:log-group:example" -> (known after apply) # forces replacement
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      ~ log_group_name           = "example" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role_policy.vpc_flowlog_role will be updated in-place
  ~ resource "aws_iam_role_policy" "vpc_flowlog_role" {
        id     = "vpc_flowlog_role:vpc_flowlog_role"
        name   = "vpc_flowlog_role"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "*" -> "arn:aws:logs:us-east-2:*:log-group:vpc-flowlog:*"
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso-aws, Action: `pull_request`*